<%@page language="java" contentType="text/html; charset=UTF-8" pageEncoding="UTF-8"%>

<!----------------------------------------------------------------------->
<!-- JSP 페이지에서 사용할 [사용자 정의 태그]인 [JSTL의 C 코어 태그] 선언 -->
<!----------------------------------------------------------------------->
<%@taglib prefix="c" uri="http://java.sun.com/jsp/jstl/core" %>

<!----------------------------------------------------------------------->
<!-- JSP페이지에서 사용할 [사용자 정의 태그]인 spring 폼 태그] 선언 -->
<!----------------------------------------------------------------------->
<%@taglib prefix="form" uri="http://www.springframework.org/tags/form" %>

<!----------------------------------------------------------------------->
<!-- JSP 페이지에서 사용할 [JQuery] -->
<!----------------------------------------------------------------------->
<script src="/erp/resources/jquery-1.11.0.min.js" type="text/javascript"></script>

<!----------------------------------------------------------------------->
<!-- JSP 페이지에서 사용할 [CSS 파일] 수입 -->
<!----------------------------------------------------------------------->
<link href="/erp/resources/style1.css" rel="stylesheet" type="text/css">

<!----------------------------------------------------------------------->
<!-- c코어 커스텀 태그을 사용하여 HttpServletRequest 객체에 bgcolor1 이라는 키값으로 pink라는 문자열 저장 -->
<!----------------------------------------------------------------------->
<c:set var="bgcolor1" value="pink" scope="request"/>
<c:set var="bgcolor2" value="skyblue" scope="request"/>

<!----------------------------------------------------------------------->

 